connecting to a new database

In [2]:
import sqlite3

In [3]:
db = sqlite3.connect('database.db')
cur = db.cursor()

In [5]:
cur.execute(''' CREATE TABLE IF NOT EXISTS store(
    store_id integer PRIMARY KEY,
name text,
location text) ''')

In [6]:
cur.execute("INSERT INTO store VALUES(1234, 'Espresso house', 'Trelleborg')")
cur.execute("INSERT INTO store VALUES(321, 'Espresso house', 'Lund')")

In [7]:
db.commit() # save changes

In [10]:
cur.execute(''' SELECT name
FROM store
where location = 'Lund' ''')
cur.fetchall()

[('Espresso house',)]

In [11]:
out = cur.execute("SELECT * FROM store")
cur.fetchall()

[(321, 'Espresso house', 'Lund'), (1234, 'Espresso house', 'Trelleborg')]

In [12]:
out = cur.execute("SELECT * FROM store")
for item in out:
    print(item)

(321, 'Espresso house', 'Lund')
(1234, 'Espresso house', 'Trelleborg')

In [13]:
cur.execute(""" UPDATE store
            SET name = 'EH'
            where name = 'Espresso house' """)

db.commit()

In [15]:
cur.execute("DELETE FROm store WHERE store_id = 1234")
db.commit()

### PANDAS

In [16]:
import pandas as pd

In [17]:
weather = pd.read_csv('austin_weather.csv')
weather.head()

,Date,TempHighF,TempAvgF,TempLowF,DewPointHighF,DewPointAvgF,DewPointLowF,HumidityHighPercent,HumidityAvgPercent,HumidityLowPercent,...,SeaLevelPressureAvgInches,SeaLevelPressureLowInches,VisibilityHighMiles,VisibilityAvgMiles,VisibilityLowMiles,WindHighMPH,WindAvgMPH,WindGustMPH,PrecipitationSumInches,Events
0,2013-12-21,74,60,45,67,49,43,93,75,57,...,29.68,29.59,10,7,2,20,4,31,0.46,"Rain , Thunderstorm"
1,2013-12-22,56,48,39,43,36,28,93,68,43,...,30.13,29.87,10,10,5,16,6,25,0,
2,2013-12-23,58,45,32,31,27,23,76,52,27,...,30.49,30.41,10,10,10,8,3,12,0,
3,2013-12-24,61,46,31,36,28,21,89,56,22,...,30.45,30.3,10,10,7,12,4,20,0,
4,2013-12-25,58,50,41,44,40,36,86,71,56,...,30.33,30.27,10,10,7,10,2,16,T,

In [19]:
db = sqlite3.connect('austin_weater.db')
weather.to_sql('weather', db)

In [42]:
Df = pd.read_sql("SELECT Date, TempHighF, TempLowF FROM weather", db)
Df.head()

         Date  TempHighF  TempLowF
0  2013-12-21         74        45
1  2013-12-22         56        39
2  2013-12-23         58        32
3  2013-12-24         61        31
4  2013-12-25         58        41

Vi vill dra ut alla rader med WindHighMPH > 10 fr[n databasen

In [24]:
df = pd.read_sql("SELECT Date, WindHighMPH, TempHighF FROM weather WHERE WindHighMPH > 10", db)

In [25]:
df.head()

         Date WindHighMPH  TempHighF
0  2013-12-21          20         74
1  2013-12-22          16         56
2  2013-12-23           8         58
3  2013-12-24          12         61
4  2013-12-26          12         57

In [27]:
df.dtypes

Date           object
WindHighMPH    object
TempHighF       int64
dtype: object

behÃ¶ver Ã¤ndra WINGHIGHMPH frÃ¥n object till integer

In [28]:
df = df[df['WindHighMPH'] != '-']
df

            Date WindHighMPH  TempHighF
0     2013-12-21          20         74
1     2013-12-22          16         56
2     2013-12-23           8         58
3     2013-12-24          12         61
4     2013-12-26          12         57
...          ...         ...        ...
1172  2017-07-27          12        103
1173  2017-07-28          14        105
1174  2017-07-29          12        107
1175  2017-07-30          13        106
1176  2017-07-31          12         99

[1177 rows x 3 columns]

In [29]:
df.dtypes

Date           object
WindHighMPH    object
TempHighF       int64
dtype: object

In [30]:
df["WindHighMPH"] = df["WindHighMPH"].astype(int)

In [31]:
df.dtypes

Date           object
WindHighMPH     int32
TempHighF       int64
dtype: object

In [36]:
subset_df = df[df["WindHighMPH"] > 10]

In [37]:
subset_df

            Date  WindHighMPH  TempHighF
0     2013-12-21           20         74
1     2013-12-22           16         56
3     2013-12-24           12         61
4     2013-12-26           12         57
6     2013-12-29           17         64
...          ...          ...        ...
1172  2017-07-27           12        103
1173  2017-07-28           14        105
1174  2017-07-29           12        107
1175  2017-07-30           13        106
1176  2017-07-31           12         99

[977 rows x 3 columns]

In [38]:
!pip install altair

Collecting altair
  Downloading altair-4.2.0-py3-none-any.whl (812 kB)
Requirement already satisfied: jinja2 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from altair) (3.0.3)
Requirement already satisfied: pandas>=0.18 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from altair) (1.3.5)
Collecting toolz
  Downloading toolz-0.11.2-py3-none-any.whl (55 kB)
Requirement already satisfied: numpy in c:\users\profs\miniconda3\envs\env\lib\site-packages (from altair) (1.21.5)
Requirement already satisfied: jsonschema>=3.0 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from altair) (4.3.2)
Requirement already satisfied: entrypoints in c:\users\profs\miniconda3\envs\env\lib\site-packages (from altair) (0.3)
Requirement already satisfied: attrs>=17.4.0 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from jsonschema>=3.0->altair) (21.2.0)
Requirement already satisfied: pyrsistent!=0.17.0,!=0.17.1,!=0.17.2,>=0.14.0 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from jsonschema>=3.0->altair) (0.18.0)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from pandas>=0.18->altair) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from pandas>=0.18->altair) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from python-dateutil>=2.7.3->pandas>=0.18->altair) (1.16.0)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\profs\miniconda3\envs\env\lib\site-packages (from jinja2->altair) (2.0.1)
Installing collected packages: toolz, altair
Successfully installed altair-4.2.0 toolz-0.11.2

In [43]:
import altair as alt
data = df[df.date > '2017-01-01']

alt.Chart(data).mark_line().encode(
    x = 'Date',
    y='TempHighF')

AttributeError: 'DataFrame' object has no attribute 'date'